{"id":1491,"date":"2019-05-18T05:06:59","date_gmt":"2019-05-18T05:06:59","guid":{"rendered":"https:\/\/cdn.floydcraft.co.uk\/?p=1491"},"modified":"2019-05-19T13:14:04","modified_gmt":"2019-05-19T13:14:04","slug":"floydbot","status":"publish","type":"post","link":"https:\/\/cdn.floydcraft.co.uk\/plugins-used\/floydbot\/","title":{"rendered":"FloydBot"},"content":{"rendered":"<p>What is FloydBot?<br \/>\nFloydBot is FloydCraft&#8217;s exclusive plugin that has multiple functions its most common being simply broadcasting messages into the server chat every 5 minutes with a helpful tip.<br \/>\nBut aswell as that it also serves use for many other functions such as ensuring the server chat is clean it will puck up on things that our NoSwear plugin will miss, if it suspects someone in chat is swearing with Unicode or bad formatted text then it will alert both owners on Discord as direct messages with timestamps of that player and there messages, it will also alert all online admins of any sign advertising \/ abuse in live chat and via eMail of no admins are online. FloydBot is also able to locate chunk errors when loaded and intersept with <a href=\"https:\/\/cdn.floydcraft.co.uk\/plugins-used\/fast-async-worldedit-fawe\/\">FAWE<\/a> to copy all data of blocks in that area, Regenerate the chunk and paste the blocks back in! failing that we can attend to it manually with <a href=\"https:\/\/cdn.floydcraft.co.uk\/plugins-used\/coreprotect\/\">CoreProtect<\/a><br \/>\nit also serves as our websites info bot, you will have noticed if you signed up with this website you will have received an email from FloydBot.<br \/>\nThe bot on the website can also assist with crating Groups and helping you to find content, it also has a large dashboard of useful utility&#8217;s for Admins from the website Dashboard and much more!<\/p>\n<p>How it Works:<br \/>\nFloydBot runs on the Minecraft Spigot server as a &#8220;.jar&#8221; file, just like pretty much all other plugins it has a config file that we use to easily change various perimeters without having to recompile anything.<br \/>\nAmongst its many configuration options is the address to connect with our website, The way the website functions with the bot is simple.<br \/>\nIt uses a basic WordPress plugin to communicate with the server, this allows the site to have realtime Player Names, automatic player Avatars and many other useful features. To protect all the connections from code injection or other exploits we have subscribed with a Domain company to have protection by <a href=\"https:\/\/bitninja.io\/\">BitNinja.io<\/a> one of the worlds best none-free WAF (Web Application Firewall) Programs for Linux to date.<br \/>\nDue to the website being connected to the server this allows banned players to automatically receive the same ban on the website depending on why they were banned.<br \/>\nFloydBot has also got full access to our eMail servers which allows us to have multiple automatons in place for players who have an email account with us, for example users can manage there in Game AuthMe account and have email verification as an extra security feature or admins and owners can email contend directly to the website by emailing FloydBot with a special subject token.<br \/>\nEvery part of floydbot is connected to each other creating one nice  big Multi Platform server automation specifically to make managing everything much easier.<\/p>\n<p>There are a lot of people that would disagree with having it setup like this but it serves its purpose better than any single bot \/ automation plugin ever could, this plugin communicates mostly on an internal network so traffic is not exposed and what is sent over WAN is protected with 2048-bit RSA encryption!<\/p>\n<p>FloydBot wouldn&#8217;t be able to do everything it can do without the help of other plugins, a portion of what FloydBot does is ruining multiple commands at specific times and running multiple commands fast in one shorter command, if you would like to see what plugins we have all together then check this link out <a href=\"https:\/\/cdn.floydcraft.co.uk\/category\/plugins-used\/\">\/\/FloydCraft\/Plugins-Used<\/a><\/p>\n<p>If you have any Questions about FloydBot or if your working on something like FloydBot for your own server  and would like some help or advice then your welcome to email me direct at <a href=\"http:\/\/m.floydcraft.co.uk\/?&amp;mailto:rmellis@m.floydcraft.co.uk\">rmellis@m.floydcraft.co.uk<\/a> If you are having problems connecting to FloydCraft and you see FloydBot mentioned in your disconnect message you should first try using a version higher than 1.12, if that fails let us know on discord or email and We&#8217;ll help you get connected again<\/p>\n<p>Aswell as everything mentioned so far FloydBot also has many other useful features such as:<\/p>\n<ul>\n<li>Alias commands with permissions<\/li>\n<li>offers ingame Help and advice to players<\/li>\n<li>can Assist in Multiple ways on the website<\/li>\n<li>can integrate with both <a href=\"https:\/\/cdn.floydcraft.co.uk\/plugins-used\/inventory-rollback\/\">InventoryRollback<\/a> and <a href=\"https:\/\/cdn.floydcraft.co.uk\/plugins-used\/coreprotect\/\">CoreProtect<\/a> and <a href=\"https:\/\/cdn.floydcraft.co.uk\/plugins-used\/fast-async-worldedit-fawe\/\">FAWE<\/a> for fast multi option rollback<\/li>\n<li>automatically ban anyone sending suspicious packets on the server and the website<\/li>\n<li>exempt<\/li>\n<li>emails owners when a donation is made via the website<\/li>\n<li>handles dead chunks within 10 seconds<\/li>\n<li>offers resource packs without that annoying popup prompt<\/li>\n<li>alerts admins on suspicious singe placements<\/li>\n<li>automatically unloads long unused chunks safely<\/li>\n<li>can avoid 0x0 glitches and exploits if specified<\/li>\n<li>will unload a plugin that outputs an unusual amount of errors using <a href=\"https:\/\/cdn.floydcraft.co.uk\/plugins-used\/pluginmanagerreloaded\/\">PluginManagerReloaded<\/a> even if covered with <a href=\"https:\/\/cdn.floydcraft.co.uk\/plugins-used\/consolespamfix\/\">ConsoleSpamFix<\/a><\/li>\n<li>Mirrors PlayerNames using <a href=\"https:\/\/cdn.floydcraft.co.uk\/plugins-used\/discordsrv\/\">DiscordSRV<\/a> on the FloydCraft <a href=\"https:\/\/discord.gg\/asAHdkM\">Discord<\/a> so rather than [FloydBot &gt; Player &gt; message] it will display [Message] FloydBot will change the name of the Bot and avatar to match the player in game aswell as the bots name, then send the message, then change the bot back to normal, this happens so fast its unnoticeable and the message in chat will forever remain as that player<\/li>\n<li>assists with opening menus from <a href=\"https:\/\/cdn.floydcraft.co.uk\/plugins-used\/deluxemenus\/\">DeluxMenus<\/a> for specific events encountered by player even without the menus permission node e.g. the black market shops at the end of the arcades hidden maze and parkour<\/li>\n<li>automatically enables &#8220;online-mode=true&#8221; if the servers lobby becomes flooded by bots whilst whitelisting known ranked players and greylisting suspected bot names for verification<\/li>\n<\/ul>\n<p>There is a lot of other things to FloydBot that isn&#8217;t listed here but in all that sums up the main functions of our servers Bot. we hope that this bot will enhance everyone&#8217;s game experience and help keep the server running smoothly whilst keeping all players up to date and informed on events and other happenings.<\/p>\n<p>We work hard to keep the bot running as smoothly and securely as possible and we would love it if you wanted to show your appreciation by donation, of course its complacently optional and we don&#8217;t want anyone to feel pressured to donate but if you would like to then head over to our <a href=\"https:\/\/cdn.floydcraft.co.uk\/web-shop\/\">Web-Shop<\/a>, you can get something In Game for your donation that way! 😀<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>What is FloydBot? FloydBot is FloydCraft&#8217;s exclusive plugin that has multiple functions its most common being simply broadcasting messages into the server chat every 5 minutes with a helpful tip. But aswell as that it also serves use for many other functions such as ensuring the server chat is clean it will puck up on&hellip;<\/p>\n","protected":false},"author":1,"featured_media":1494,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[24],"tags":[],"_links":{"self":[{"href":"https:\/\/cdn.floydcraft.co.uk\/wp-json\/wp\/v2\/posts\/1491"}],"collection":[{"href":"https:\/\/cdn.floydcraft.co.uk\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/cdn.floydcraft.co.uk\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/cdn.floydcraft.co.uk\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/cdn.floydcraft.co.uk\/wp-json\/wp\/v2\/comments?post=1491"}],"version-history":[{"count":3,"href":"https:\/\/cdn.floydcraft.co.uk\/wp-json\/wp\/v2\/posts\/1491\/revisions"}],"predecessor-version":[{"id":1619,"href":"https:\/\/cdn.floydcraft.co.uk\/wp-json\/wp\/v2\/posts\/1491\/revisions\/1619"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/cdn.floydcraft.co.uk\/wp-json\/wp\/v2\/media\/1494"}],"wp:attachment":[{"href":"https:\/\/cdn.floydcraft.co.uk\/wp-json\/wp\/v2\/media?parent=1491"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/cdn.floydcraft.co.uk\/wp-json\/wp\/v2\/categories?post=1491"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/cdn.floydcraft.co.uk\/wp-json\/wp\/v2\/tags?post=1491"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}