{"id":3296,"date":"2021-01-13T02:15:32","date_gmt":"2021-01-13T02:15:32","guid":{"rendered":"https:\/\/cdn.floydcraft.co.uk\/?p=3296"},"modified":"2021-01-13T02:15:32","modified_gmt":"2021-01-13T02:15:32","slug":"deathmessagesprime","status":"publish","type":"post","link":"https:\/\/cdn.floydcraft.co.uk\/plugins-used\/deathmessagesprime\/","title":{"rendered":"Death Messages Prime"},"content":{"rendered":"<p>Source: <a href=\"https:\/\/www.spigotmc.org\/resources\/deathmessagesprime.3789\/\" target=\"_blank\" rel=\"noopener\"><span style=\"text-decoration: underline; color: #00ccff;\">https:\/\/www.spigotmc.org\/resources\/deathmessagesprime.3789\/<\/span><\/a><\/p>\n<p><i><b>DeathMessagesPrime <\/b><\/i>is a simple-to-use but still versatile death message plugin. It allows to freely format and modify all death messages in Minecraft to date.<\/p>\n<p>Note from the new author Joshb_: Hello all, excited to take over this project. I will bring a new version for you soon. However, I need to make my current plugins stable until I fully work on this project. I will be picking away at it here and there in between my current projects. In the meantime, the former author did a decent job making it usable in all new plugin versions.<\/p>\n<p>Join my discord if you have suggestions or problems. Some of the users already joined and are doing a good job helping each other out.<\/p>\n<p><a href=\"https:\/\/discord.gg\/K9zVDwt\" target=\"_blank\" rel=\"noopener\">https:\/\/discord.gg\/K9zVDwt<\/a><\/p>\n<p><b>CraftBukkit is NOT supported. Please use Spigot instead. This plugin requires the BungeeCord API for messages, which is not present on CraftBukkit.<\/b><\/p>\n<p>Want to&#8230;<\/p>\n<ul>\n<li>&#8230;change the death message for someone being blown up a creeper?<\/li>\n<li>&#8230;have multiple different death message choices depending on whether people die from a short or long fall?<\/li>\n<li>&#8230;add a custom message only for one of your VIP players for dying after being shoved into the void?<\/li>\n<\/ul>\n<p>No problem, this plugin can handle all of those cases.<\/p>\n<p><b>Commands<\/b><br \/>\n\/dmsg allows to reload the configuration. The permission node <i>deathmessagesprime.reload<\/i> controls the ability to do so. Further, the command without any parameters will display the plugin version and available commands, if the player has the <i>deathmessagesprime.version<\/i> permission.<\/p>\n<p>\/toggledeathmsg allows players to toggle displaying death messages to themselves, with the <i>deathmessagesprime.toggle <\/i>permission. Note that this permission is originally for OPs only, which is not what you may want.<\/p>\n<p>The plugin also has a debug mode which can be enabled from the configuration to aid solving conflicts.<\/p>\n<p>Examples of some versatile features of this plugin:<\/p>\n<ul>\n<li>Allows distinguishing between non-named and named mobs in death messages and displaying forms of them in the death messages.<\/li>\n<li>Separates normal and elder Guardians.<\/li>\n<li>Supports CrackShot (kind of)<\/li>\n<li>Allows to disable PVP and non-PVP messages in specific worlds<\/li>\n<li>A world group feature to display death messages in a specific world in its group only<\/li>\n<li>Multiple death messages for each reason<\/li>\n<li>Biome in death messages<\/li>\n<li>Distinguishes between short and long fall kills (like Minecraft does, compare &#8220;hit the ground too hard&#8221; and &#8220;fell from a high place&#8221;)<\/li>\n<li>Allows to specify death messages when &#8216;pushed&#8217; by a mob or player<\/li>\n<li>Allows changing lightning\/enderpearl death messages (same in vanilla Minecraft as fire tick\/fall messages)<\/li>\n<li>Supports player display names in messages<\/li>\n<li>Custom messages for mobs with specific names, per regex (therefore support for custom bosses)<\/li>\n<li>Supports item tooltips for when the weapon is displayed in a message<\/li>\n<li>Death messages within a radius and 1&amp;1 (only killer and victim receives the message) for PVP deaths<\/li>\n<li>heart-compat-mode for plugins that may display a health bar as the mob name<\/li>\n<li>API for getting the death message, addons with events and custom tag support (with javadocs)<\/li>\n<\/ul>\n<p><b>Common problems\/questions &amp; solutions<\/b><br \/>\n<i>Hearts appear in the death message instead of the mob&#8217;s name<\/i><br \/>\nEnable heart-compat-mode from within the configuration file (from false to true).<\/p>\n<p><i>Adding multiple death messages so that one is picked at random<\/i><br \/>\nSimply add multiple death messages under a specific reason (adding further messages with the same hyphen-first syntax). The plugin will pick one of the messages at random upon a death.<\/p>\n<p><i>Various conflicts with compat-mode on or off<\/i><br \/>\nIf you&#8217;re a plugin developer and you modify the death message in PlayerDeathEvent, make sure your plugin&#8217;s event priority is less than HIGHEST, which is the priority DMP uses to detect and solve conflicts.<\/p>\n<p>If you are a server administrator, you should contact the developers of both plugins, if possible. DMP so far has a fairly advanced mechanism for detecting conflicts, but it&#8217;s not perfect.<\/p>\n<p><i>Add support for plugin X!<\/i><br \/>\nYou should ask the developer of plugin X: DMP has an API. In fact, no API whatsoever is needed, as long as the other plugin uses the standard setDeathMessage via PlayerDeathEvent on any priority lower than HIGHEST, and no extra DMP features (such as messages within DMP configs) are needed. For plugins that check on MONITOR, you can try DMPMonitorCompat.<\/p>\n<p><i>invalid character, unacceptable code point, special characters are not allowed&#8230;<\/i><br \/>\nUse a text editor that supports UTF-8. Most modern editors and even some older ones should support it (note that Notepad does not fully support it, unless you are on Windows 10 May 2019 or above). If your editor does support it, make sure you&#8217;re saving the file as UTF-8 (the exact steps depend on your text editor). You should <b>not <\/b>save with BOM (byte order mark), but without it.<\/p>\n<p><i>ClassNotFoundException: net.md_5.bungee.api&#8230;<\/i><br \/>\nYou are likely running CraftBukkit, which is not supported by this plugin. Please migrate to Spigot instead.<\/p>\n<p><i>%weapon_name%, %weapon% display ???<\/i><br \/>\nThis happens if you are using them in unsupported messages. Out of PVP messages, only PlayerCustom, PlayerTridentCustom and PlayerProjectileCustom support these two placeholders. The rest are FallKillWeapon, FallFinishKillWeapon, and under mob messages everything ending in Custom.<\/p>\n<p>These Custom messages are used whenever the weapon used for the kill has a custom name, while the messages without %weapon% are used for hand kills or kills made with weapons without custom names.<\/p>\n<p>You can make the plugin use the Custom messages, with %weapon%, for the latter by enabling show-custom-death-msg-on-all-weapons. Hand kills will still use the messages without %weapon%.<\/p>\n<p><b>Official &amp; featured plugins<\/b><br \/>\n<i>The plugins below may require DeathMessagesPrime or provide extra functionality if it is installed.<\/i><\/p>\n<ul>\n<li>DMPInventoryPlayerInfo &#8211; allows adding a clickable %inventory% tag to death messages<\/li>\n<li>DMPHideMessages &#8211; allows individual players to hide\/block death messages from specific players<\/li>\n<li>DMPPlaceholderAPI &#8211; a bridge between DeathMessagesPrime and PlaceholderAPI<\/li>\n<li>DMPWorldGuard &#8211; a bridge between DeathMessagesPrime and WorldGuard, allows to block and customize messages from within regions<\/li>\n<li>DMPMonitorCompat &#8211; adds compatibility with chat plugins that use MONITOR priority (see list on the plugin page)<\/li>\n<li>DMPCitizens &#8211; adds NPC support for death messages<\/li>\n<li>DMPEnderCrystal &#8211; adds End Crystal kill and suicide messages<\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>Source: https:\/\/www.spigotmc.org\/resources\/deathmessagesprime.3789\/ DeathMessagesPrime is a simple-to-use but still versatile death message plugin. It allows to freely format and modify all death messages in Minecraft to date. Note from the new author Joshb_: Hello all, excited to take over this project. I will bring a new version for you soon. However, I need to make my&hellip;<\/p>\n","protected":false},"author":1,"featured_media":3298,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[24],"tags":[136,130,132,131,133,135,134],"_links":{"self":[{"href":"https:\/\/cdn.floydcraft.co.uk\/wp-json\/wp\/v2\/posts\/3296"}],"collection":[{"href":"https:\/\/cdn.floydcraft.co.uk\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/cdn.floydcraft.co.uk\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/cdn.floydcraft.co.uk\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/cdn.floydcraft.co.uk\/wp-json\/wp\/v2\/comments?post=3296"}],"version-history":[{"count":1,"href":"https:\/\/cdn.floydcraft.co.uk\/wp-json\/wp\/v2\/posts\/3296\/revisions"}],"predecessor-version":[{"id":3297,"href":"https:\/\/cdn.floydcraft.co.uk\/wp-json\/wp\/v2\/posts\/3296\/revisions\/3297"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/cdn.floydcraft.co.uk\/wp-json\/wp\/v2\/media\/3298"}],"wp:attachment":[{"href":"https:\/\/cdn.floydcraft.co.uk\/wp-json\/wp\/v2\/media?parent=3296"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/cdn.floydcraft.co.uk\/wp-json\/wp\/v2\/categories?post=3296"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/cdn.floydcraft.co.uk\/wp-json\/wp\/v2\/tags?post=3296"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}