{"id":418,"date":"2019-04-24T23:38:50","date_gmt":"2019-04-24T23:38:50","guid":{"rendered":"https:\/\/cdn.floydcraft.co.uk\/?page_id=418"},"modified":"2019-04-24T23:46:17","modified_gmt":"2019-04-24T23:46:17","slug":"history-of-floydcraft","status":"publish","type":"page","link":"https:\/\/cdn.floydcraft.co.uk\/history-of-floydcraft\/","title":{"rendered":"🕰️ Brief History of FloydCraft"},"content":{"rendered":"<div id=\"content\">\n<p class=\"p1\"><span class=\"s1\" style=\"color: #cc99ff;\"><strong>November 18, 2011<\/strong><br \/>\n<\/span><span class=\"s1\" style=\"color: #ffcc00;\">FloydCraft 1.0 First Started as a Very Glitchy Tests on local server, this was for friends only on a Virtual Private Network, Everyone was OP and lessons were learnt fast. After a while rmellis begun to add Plugins for the first time, starting with a port of the mod single player commands called Multiplayer Commands (no longer existent) this allows us to fly and switch game modes whenever, a spawn was built and it was not pretty, it was a Huge flowstone Box, i don’t have a screenshot unfortunately<\/span><\/p>\n<p class=\"p3\"><span class=\"s1\" style=\"color: #cc99ff;\"><strong>January 12, 2012<\/strong><br \/>\n<\/span><span class=\"s2\" style=\"color: #ffcc00;\">FloydCraft 1.1 Was Born, This is where FloydCraft First entered the server competition, we were floydcraft.servegame.com, back then there was very few servers, we were probably 1 of at most 500 Minecraft servers, our main rival was a server called Cloud Craft that closed in 2013, though they were rivals they ran a very good server and it inspired a lot of the survival aspects we have today. <\/span><\/p>\n<p class=\"p4\"><span class=\"s1\" style=\"color: #cc99ff;\"><strong>March 1, 2012<\/strong><br \/>\n<\/span><span class=\"s1\"><span style=\"color: #ffcc00;\">FloydCraft begun adding a stack lode of plugins fast and we gather a small community of regular players, We were 1 of the first servers to offer Free Instant access to a large survival and creative world, back then every player could choose there gamemode’s as players were a lot more trusted in 2012 and glitches weren’t well known and exploited, after a while we got a nice spawn setup that was a underground tunnel with signs explaining the server and a stairs leading up at the end whilst in a large sure glass dome, See pic below behind me and notch is the original FloydCraft spawn from 2012<\/span><a href=\"https:\/\/web.archive.org\/web\/20180412161632\/https:\/\/cdn.floydcraft.co.uk\/WebApp\/wp-content\/uploads\/2018\/03\/Screen-Shot-2018-03-17-at-19.23.08.png\"><img loading=\"lazy\" class=\" wp-image-575 aligncenter\" src=\"https:\/\/web.archive.org\/web\/20180412161632im_\/https:\/\/cdn.floydcraft.co.uk\/WebApp\/wp-content\/uploads\/2018\/03\/Screen-Shot-2018-03-17-at-19.23.08-300x177.png\" sizes=\"(max-width: 455px) 100vw, 455px\" srcset=\"https:\/\/web.archive.org\/web\/20180412161632im_\/https:\/\/cdn.floydcraft.co.uk\/WebApp\/wp-content\/uploads\/2018\/03\/Screen-Shot-2018-03-17-at-19.23.08-300x177.png 300w, https:\/\/web.archive.org\/web\/20180412161632im_\/https:\/\/cdn.floydcraft.co.uk\/WebApp\/wp-content\/uploads\/2018\/03\/Screen-Shot-2018-03-17-at-19.23.08.png 743w\" alt=\"\" width=\"455\" height=\"269\" \/><\/a><\/span><\/p>\n<p class=\"p4\"><span class=\"s1\" style=\"color: #cc99ff;\"><strong>December 20, 2012<\/strong><br \/>\n<\/span><span class=\"s1\" style=\"color: #ffcc00;\">FloydCraft Officially Updated to Bukkit 1.4 and Added some fun new Plugins Including Mob Arena, Towny, ZombFly and more, The players built 2 large cities, one outside spawn and a desert city a little away, there was a mincer track that went there via the sky or there was a underground rail system built by Geoff79<\/span><\/p>\n<p class=\"p4\"><span class=\"s1\" style=\"color: #cc99ff;\"><strong>March 21, 2013<\/strong><br \/>\n<\/span><span class=\"s1\" style=\"color: #ffcc00;\">Floydcraft Became a 1.5.1 Server and Created an entire new world for players to enjoy, we had a Huge water temple for spawn and a large set of shops outside, Vampires was added as well as MCMMO, The server began to get more popular at this point and was starting to see on average 20 players online a day and a donation a month, unfortunately it is around this time Minecraft servers started to become a lot more common and we began losing players and money fast, as more new Minecraft servers were appearing with new features and ability ours was left behind for a few months and started to see on average 3 – 6 players a day. <\/span><\/p>\n<p class=\"p4\"><span class=\"s1\" style=\"color: #cc99ff;\"><strong>May 2, 2013<\/strong><br \/>\n<\/span><span class=\"s1\" style=\"color: #ffcc00;\">FloydCraft became a 1.5.2 server and took advantage of the Redstone Update and gather some of the best reds toners i know if to make some cool stuff, We had a 5×5 Piston Door with a command block operated minigame behind, wireless redstone ability and much more, this helped get the player numbers up a little but there was a lot more servers appearing making it impossible to not lose money just to keep, after investing my own money into the servers physical Power i then began on completely Rebuilding the server from start to finish in 1.5.2, The result was pretty good and was completed some months after.<\/span><\/p>\n<p class=\"p7\"><span class=\"s1\" style=\"color: #cc99ff;\"><strong>July 1, 2013<\/strong><br \/>\n<\/span><span class=\"s3\" style=\"color: #ffcc00;\">FloydCraft had skipped the new Update to Minecraft 1.6 and was ready to bring a brand new server experience to players, We had put together a server that had a Awesome Spawn, Normal Survival world (Huge), Nether World and a End World. We added a LOT of plugins this time around including Essentials, Vampires, MCMMO, GroupManager, MCORE, SimpleClans, Towny, Nicks, Simple Broadcaster and Lots more! After weighting a detailed ad for the server explaining what we offer in comparison to other common servers that were cropping up all over the place at the time a lot more players started joining, Unfortunately a lot of players did lose there builds from the server transformation but now we know for future not to delete the old worlds. Our Player count was going back up to a average 20 and we were back to getting on average £10 a month donations which was pretty good to say it was just a hobby.<\/span><\/p>\n<p class=\"p4\"><span class=\"s1\" style=\"color: #cc99ff;\"><strong>July 8, 2013<\/strong><br \/>\n<\/span><span class=\"s1\" style=\"color: #ffcc00;\">rmellis made a deal with a Local Computer Recycling Centre for Free High Powerd Servers for Free to replace Any FloydCraft servers that Break, In return i had to work a few years unpaid in a computer shop but it was all good fun and i learnt a lot whilst doing it, We were thenin possession of a nice high powered Quad Core Dual CPU XEON Server with 16GB RAM, At the time this was a huge improvement for FloydCraft as it had been running on a basic tower with 6GB RAM until then. The New Server was all setup and installed with Linux and OpenJDK, The server had never run so smoothly and players were loving it! <\/span><\/p>\n<p class=\"p4\"><span class=\"s1\" style=\"color: #cc99ff;\"><strong>September 19, 2013<\/strong><br \/>\n<\/span><span class=\"s1\" style=\"color: #ffcc00;\">FloydCraft became a 1.6 Server (better late than never) and received a few more fancy updates, This is where we added the Sphax Texture Pack and where rmellis began learning Java Programming and taking Computer and Networking courses, practising my new java skills i created FloydBot, a basic bot that announces messages into the server automatically (still used to this day) and some admin tools i made for tests that worked pretty well, FloydCraft was then Advertised on New Websites like Planet Minecraft and Minecraft Multiplayer and more<\/span><\/p>\n<p class=\"p7\"><span class=\"s1\" style=\"color: #cc99ff;\"><strong>October 25, 2013<\/strong><br \/>\n<\/span><span class=\"s1\" style=\"color: #ffcc00;\">Floydcraft had just generated it’s world for 1.6 and then Minecraft 1,7 was released, and it just so happened that this was the update that changed the world… so we had to create a new world.. This is where the Multiverse was born! FloydCraft Updated to Bukkit 1.7.2 and added a Second world generated to the new world standards which had the smoother biomes you see in more modern MC, <\/span><\/p>\n<p class=\"p4\"><span class=\"s1\" style=\"color: #cc99ff;\"><strong>December 10, 2013<\/strong><br \/>\n<\/span><span class=\"s1\" style=\"color: #ffcc00;\">The FloydCraft Website Became Archived Online from July, You can view our website as it was then here<\/span><\/p>\n<p class=\"p4\"><span class=\"s1\"><span style=\"color: #00ff00;\"><a style=\"color: #00ff00;\" href=\"https:\/\/web.archive.org\/web\/20130706003930\/http:\/\/floydcraft.servegame.com\/\"><span class=\"s4\">https:\/\/web.archive.org\/web\/20130706003930\/http:\/\/floydcraft.servegame.com\/<\/span><\/a><\/span><\/span><\/p>\n<p class=\"p4\"><span class=\"s1\" style=\"color: #cc99ff;\"><strong>June 26, 2014<\/strong><br \/>\n<\/span><span class=\"s1\" style=\"color: #ffcc00;\">FloydCraft Added Minigames and had Dedicated Admins, The server was run smoothly for almost a year with no changes<\/span><\/p>\n<p class=\"p7\"><span class=\"s1\" style=\"color: #cc99ff;\"><strong>September 2, 2014<\/strong><br \/>\n<\/span><span class=\"s1\" style=\"color: #ffcc00;\">Minecraft 1.8 was releaced However Floydcraft stuck with Minecraft 1,7 for a while longer, to allow 1.8 players to play we used a unofficial Spigot build that had its Protocols open to 1.8 clients meaning both 1.7 and 1.8 clients could play even though the server was based on 1.7., this meant that we could continue using the plugins we already had as the conversion from 1.7 to 1.8 was pretty much a complete re-wright so old plugging were only a 20% chance of workingafter<\/span><\/p>\n<p class=\"p4\"><span class=\"s1\" style=\"color: #cc99ff;\"><strong>November 24, 2014<\/strong><br \/>\n<\/span><span class=\"s1\"><span style=\"color: #ffcc00;\">rmellis completed 3x Microsoft Exams, 1x Cisco Exam and a Java Exam, The MTA’s, CCNA’s added up to a nice MCP Award (Microsoft Certified Professional)<\/span><a href=\"https:\/\/web.archive.org\/web\/20180412161632\/https:\/\/cdn.floydcraft.co.uk\/WebApp\/wp-content\/uploads\/2018\/03\/1477938_1437795623110416_2113833248_n.jpg\"><img loading=\"lazy\" class=\"wp-image-576 aligncenter\" src=\"https:\/\/web.archive.org\/web\/20180412161632im_\/https:\/\/cdn.floydcraft.co.uk\/WebApp\/wp-content\/uploads\/2018\/03\/1477938_1437795623110416_2113833248_n-300x212.jpg\" sizes=\"(max-width: 467px) 100vw, 467px\" srcset=\"https:\/\/web.archive.org\/web\/20180412161632im_\/https:\/\/cdn.floydcraft.co.uk\/WebApp\/wp-content\/uploads\/2018\/03\/1477938_1437795623110416_2113833248_n-300x212.jpg 300w, https:\/\/web.archive.org\/web\/20180412161632im_\/https:\/\/cdn.floydcraft.co.uk\/WebApp\/wp-content\/uploads\/2018\/03\/1477938_1437795623110416_2113833248_n-768x542.jpg 768w, https:\/\/web.archive.org\/web\/20180412161632im_\/https:\/\/cdn.floydcraft.co.uk\/WebApp\/wp-content\/uploads\/2018\/03\/1477938_1437795623110416_2113833248_n.jpg 960w\" alt=\"\" width=\"467\" height=\"330\" \/><\/a><\/span><\/p>\n<p class=\"p3\"><span style=\"color: #cc99ff;\"><strong><span class=\"s1\">February 19, 2015<br \/>\n<\/span><\/strong><\/span><span class=\"s1\" style=\"color: #ffcc00;\">rmellis got a job at a large computer company called Fujitsu and didnt have much time to run the server, as a result admins were running it whalst i was at work and it became very unstable and glitchy. <\/span><\/p>\n<p><span style=\"color: #cc99ff;\"><strong><span class=\"s1\">April 25, 2015<br \/>\n<span class=\"s1\" style=\"color: #ffcc00;\">Floydcraft Changed the IP From floydcraft.servegame.com to floydcraft.co.uk<\/span><br \/>\n<\/span><\/strong><\/span><\/p>\n<p class=\"p3\"><span style=\"color: #cc99ff;\"><strong><span class=\"s1\">June 5, 2015<br \/>\n<\/span><\/strong><\/span><span class=\"s2\"><span style=\"color: #ffcc00;\">FloydCraft Finally did the update to 1.8 and Updated all the plugins manual, FloydBot was extended and became its own API. A Huge underground shopping centre was added at the time, Gold Became Money for the first time in a year and a player built his own huge island in the sky, see image below from dynamo of his build<\/span><a href=\"https:\/\/web.archive.org\/web\/20180412161632\/https:\/\/cdn.floydcraft.co.uk\/WebApp\/wp-content\/uploads\/2018\/03\/screenshot2015-01-12at1432028536747.jpg\"><img loading=\"lazy\" class=\"wp-image-578 aligncenter\" src=\"https:\/\/web.archive.org\/web\/20180412161632im_\/https:\/\/cdn.floydcraft.co.uk\/WebApp\/wp-content\/uploads\/2018\/03\/screenshot2015-01-12at1432028536747-300x225.jpg\" sizes=\"(max-width: 499px) 100vw, 499px\" srcset=\"https:\/\/web.archive.org\/web\/20180412161632im_\/https:\/\/cdn.floydcraft.co.uk\/WebApp\/wp-content\/uploads\/2018\/03\/screenshot2015-01-12at1432028536747-300x225.jpg 300w, https:\/\/web.archive.org\/web\/20180412161632im_\/https:\/\/cdn.floydcraft.co.uk\/WebApp\/wp-content\/uploads\/2018\/03\/screenshot2015-01-12at1432028536747.jpg 720w\" alt=\"\" width=\"499\" height=\"374\" \/><\/a><\/span><\/p>\n<p class=\"p4\"><span style=\"color: #cc99ff;\"><strong><span class=\"s1\">December 9, 2015<br \/>\n<\/span><\/strong><\/span><span class=\"s1\"><span style=\"color: #ffcc00;\">rmellis built a new spawn for the server see below images<\/span><a href=\"https:\/\/web.archive.org\/web\/20180412161632\/https:\/\/cdn.floydcraft.co.uk\/WebApp\/wp-content\/uploads\/2018\/03\/58369413.jpg\"><img loading=\"lazy\" class=\" wp-image-577 aligncenter\" src=\"https:\/\/web.archive.org\/web\/20180412161632im_\/https:\/\/cdn.floydcraft.co.uk\/WebApp\/wp-content\/uploads\/2018\/03\/58369413-300x225.jpg\" sizes=\"(max-width: 505px) 100vw, 505px\" srcset=\"https:\/\/web.archive.org\/web\/20180412161632im_\/https:\/\/cdn.floydcraft.co.uk\/WebApp\/wp-content\/uploads\/2018\/03\/58369413-300x225.jpg 300w, https:\/\/web.archive.org\/web\/20180412161632im_\/https:\/\/cdn.floydcraft.co.uk\/WebApp\/wp-content\/uploads\/2018\/03\/58369413.jpg 640w\" alt=\"\" width=\"505\" height=\"379\" \/><br \/>\n<\/a><a href=\"https:\/\/web.archive.org\/web\/20180412161632\/https:\/\/cdn.floydcraft.co.uk\/WebApp\/wp-content\/uploads\/2018\/03\/screenshot2015-01-12at1401318536742.jpg\"><img loading=\"lazy\" class=\" wp-image-579 aligncenter\" src=\"https:\/\/web.archive.org\/web\/20180412161632im_\/https:\/\/cdn.floydcraft.co.uk\/WebApp\/wp-content\/uploads\/2018\/03\/screenshot2015-01-12at1401318536742-300x225.jpg\" sizes=\"(max-width: 510px) 100vw, 510px\" srcset=\"https:\/\/web.archive.org\/web\/20180412161632im_\/https:\/\/cdn.floydcraft.co.uk\/WebApp\/wp-content\/uploads\/2018\/03\/screenshot2015-01-12at1401318536742-300x225.jpg 300w, https:\/\/web.archive.org\/web\/20180412161632im_\/https:\/\/cdn.floydcraft.co.uk\/WebApp\/wp-content\/uploads\/2018\/03\/screenshot2015-01-12at1401318536742.jpg 720w\" alt=\"\" width=\"510\" height=\"382\" \/><\/a><\/span><\/p>\n<p class=\"p7\"><span style=\"color: #cc99ff;\"><strong><span class=\"s1\">February 29, 2016<br \/>\n<\/span><\/strong><\/span><span class=\"s1\" style=\"color: #ffcc00;\">Shopkeepers were added so that Players had the ability to setup there own shops, Mob Arena Passed Away (R.I.P) and Paintball Arena took its place swell as the parkour we still have to this day!<\/span><\/p>\n<p class=\"p3\"><span style=\"color: #cc99ff;\"><strong><span class=\"s1\">May 10, 2016<br \/>\n<\/span><\/strong><\/span><span class=\"s1\" style=\"color: #ffcc00;\">What have Microsoft Done!?! they have destroyed minecraft! i give up… ended the server due to the horrible 1.9 update, chunk errors and too much cyber attacking from the competition. but then I Met a Beautiful girl and fell in love, found out she was a Minecraft n00b, forced together a 1.5.2 server over a month whilst she played single player, Integrated all plugins from previous servers and used the FloydBot API for easily adding custom commands and announcements, Opened the server back up on floydcraft.co.uk for 1.5.2 specifically for PowerPC Based Macs as we were both enjoying using PowerMacs at the time for fun and Created what is now probably the Best Floydcraft we have had yet so far whilst teaching Tallulah95 everything she knows now about MC, within about 2 months she went from mining log with a pickaxe to managing a server like a professional experienced admin, Everyone at Floydcraft is Very proud of her and happy to have a fun and helpful extra owner.<\/span><\/p>\n<p class=\"p7\"><span style=\"color: #cc99ff;\"><strong><span class=\"s1\">November 14, 2016<br \/>\n<\/span><\/strong><\/span><span class=\"s1\" style=\"color: #ffcc00;\">FloydCraft Added a lot of extra worlds including the Nordic World, Tropical World, Antartica, City World, Custom Nether, Custom Epic End, Nether City and more! the hub was extended to the old spawn which can still be accessed from \/warp oldspawn and go down stairs opposite the mines.<\/span><\/p>\n<p class=\"p3\"><span style=\"color: #cc99ff;\"><strong><span class=\"s1\">March 12, 2017<br \/>\n<\/span><\/strong><\/span><span class=\"s1\" style=\"color: #ffcc00;\">FloydCraft Wanted to continue Supporting PowerPC Macs but the only way to do this was ti run in offline mode.. However we didn’t want to be a dirty illegal cracked server like blockdrop so we came up with a way that we can run our server in offline mode and not have to have everyone using illegal launchers! We will GIVE you a FREE Minecraft Premium Account Just For Playing Regular! Every Month we give away 1 Account to a Player who Loves Minecraft but just can’t afford it, Its not fair that they should miss out on Minecraft just because they cannot afford it so by choosing to play here you are going the legal way towards a Genuine Mojang Account!<\/span><\/p>\n<p class=\"p3\"><span style=\"color: #cc99ff;\"><strong><span class=\"s1\">April 4, 2017<br \/>\n<\/span><\/strong><\/span><span class=\"s1\" style=\"color: #ffcc00;\">Added New Worlds: Epic World Mini and Created 2 New FloydCraft Servers! FloydCraft Bedrock Edition to Play on your Phone, Console or windows 10 device, and a Premium 1.12 Server that we are working on bringing unto spec with the 1.5.2 server and adding a lot more Awesome features for the players who win Premium accounts! The Premium Accounts will also come with a Key for Minecraft Windows 10 Edition that you can use to join our bedrock Server (same IP)<\/span><\/p>\n<p class=\"p3\"><span style=\"color: #cc99ff;\"><strong><span class=\"s1\">June 7, 2017<br \/>\n<\/span><\/strong><\/span><span class=\"s1\" style=\"color: #ffcc00;\">rmellis and Tallulah95 contacted the local computer recycling centre we have a deal with and got our selves a very high powered 16 Core Server with 64GB RAM, due to the Huge amount of plugins we added lag was becoming an issue even on the High powered server because of the hard drive read\/wright speeds<\/span><\/p>\n<p class=\"p4\"><span style=\"color: #cc99ff;\"><strong><span class=\"s1\">August 3, 2017<\/span><\/strong><\/span><\/p>\n<p class=\"p4\"><span class=\"s1\" style=\"color: #ffcc00;\">rmellis created a new startup script for the server that loads every world and its contents into RAM on boot, This gives the ability to read\/wright around 300x faster than any HardDrive ever could, it can even outperform SSD’s in RAID0! The only problem is that turning the server on takes unto a hour due to copying the data from the HDD to RAM, Once loaded all 100+ Plugins can run without issue and conflict all they want with no bugs, the server can take a lot of abuse now as can be seen on youtube where someone launches a basic MC-DOS Attack on us from a IRC Controlled BotNet and out server just takes it, The World is automatically saved back to the Hard Drive every Hour, It saves at a steady speed as not to slow the server down and if the server crashes saving will automatically start before shutdown is allowed to complete.<\/span><\/p>\n<p class=\"p4\"><span style=\"color: #cc99ff;\"><strong><span class=\"s1\">October 28, 2017<br \/>\n<\/span><\/strong><\/span><span class=\"s1\" style=\"color: #ffcc00;\">FloydCraft was accepted to have a booth at CubedCon!!! Cubed is an event where lodes of popular Minecraft server owners and youtubers get together in Minecraft and have a ignore MineCon with a Live Stream, They Talk with Server Owners, Tour Booths, Talk with Youtubers and Its all for Charity, This Years Cubed raised £600 for Special Effect and the Previous year raised £1000 and we are Very happy to now be a part of this and will defiantly be taking part in the next year’s event!<\/span><\/p>\n<p class=\"p3\"><span class=\"s1\" style=\"color: #cc99ff;\"><strong>February 1, 2018<\/strong><br \/>\n<\/span><span class=\"s1\" style=\"color: #ffcc00;\">SkyWays MiniGame was added to FloydCraft, after many players had been pretty much begging for it all year we added it, we let the players (you) build the arenas yourselves and they all got added, there is now toughs of arenas to play in, just go to the arena with a friend or any other player to check out a random map! Mob Arena was also Patched to fix a glitch with players using Magic Spells to leap out<\/span><\/p>\n<p class=\"p4\"><span class=\"s1\" style=\"color: #cc99ff;\"><strong>March 18, 2018<\/strong><br \/>\n<\/span><span class=\"s1\" style=\"color: #ffcc00;\">Here We Are…. Hope you enjoyed reading the history of FloydCraft… any more Questions feel free to ask me in our Discord or email me at rmellis@m.floydcraft.co.uk<\/span><\/p>\n<p class=\"p4\"><span class=\"s1\" style=\"color: #cc99ff;\"><strong>September 21, 2018<\/strong><br \/>\n<\/span><span class=\"s1\" style=\"color: #ffcc00;\">Cubed 2018 happend, check out our video from that event below<br \/>\n<a href=\"https:\/\/www.youtube.com\/watch?v=fo_h4D5LjGs\">https:\/\/www.youtube.com\/watch?v=fo_h4D5LjGs<\/a><br \/>\n<\/span><\/p>\n<\/div>\n<div><span style=\"color: #a557f2;\">April 2019<\/span><\/div>\n<div><span style=\"color: #ffb03b;\">Server pur back online under 1.2.2 open to 1.7 &#8211; 1.13 and Bedrock 1.5<br \/>\n(bedrock with pre-user warning) <\/span><\/div>\n","protected":false},"excerpt":{"rendered":"<p>November 18, 2011 FloydCraft 1.0 First Started as a Very Glitchy Tests on local server, this was for friends only on a Virtual Private Network, Everyone was OP and lessons were learnt fast. After a while rmellis begun to add Plugins for the first time, starting with a port of the mod single player commands&hellip;<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/cdn.floydcraft.co.uk\/wp-json\/wp\/v2\/pages\/418"}],"collection":[{"href":"https:\/\/cdn.floydcraft.co.uk\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/cdn.floydcraft.co.uk\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/cdn.floydcraft.co.uk\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/cdn.floydcraft.co.uk\/wp-json\/wp\/v2\/comments?post=418"}],"version-history":[{"count":4,"href":"https:\/\/cdn.floydcraft.co.uk\/wp-json\/wp\/v2\/pages\/418\/revisions"}],"predecessor-version":[{"id":423,"href":"https:\/\/cdn.floydcraft.co.uk\/wp-json\/wp\/v2\/pages\/418\/revisions\/423"}],"wp:attachment":[{"href":"https:\/\/cdn.floydcraft.co.uk\/wp-json\/wp\/v2\/media?parent=418"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}